Repository: AcerxX/ROCF-Web-Experience
Catalog: translations/messages.*.xlf
Languages: ro

# general.password
source: Password
ro: Parola

# general.first_name
source: First Name
ro: Nume

# general.last_name
source: Last Name
ro: Prenume

# general.error
source: Error!
ro: Eroare!

# register.confirm_password
source: Confirm Password
ro: Confirma parola

# register.i_agree
source: I agree with
ro: Sunt de acord cu

# register.terms_conditions
source: Terms and Conditions
ro: Termenii si Conditiile

# register.keep_informed
source: I want to subscribe to the newsletter
ro: Doresc sa fiu tinut la curent cu noutatile

# register.submit
source: Register
ro: Inregistrare

# register.sign_up
source: Register
ro: Inregistrare

# register.password_info
source: Password should contain at least 8 characters, one small letter, one capital letter and one digit
ro: Parola trebuie sa aiba minim 8 caractere, trebuie sa contina cel putin o litera mica, o litera mare si o cifra!

# register.empty_field
source: Field cannot be empty!
ro: Campul nu poate fi gol!

# register.valid_email
source: Please enter a valid email!
ro: Indroduceti un email valid!

# register.valid_password
source: Please enter a valid password!
ro: Indroduceti o parola valida!

# register.passwords_not_match
source: Passwords do not match!
ro: Cele doua parole nu corespund!

# register.terms_conditions_not_checked
source: To continue you must accept Terms and Conditions
ro: Pentru a continua trebuie sa fiti de acord cu Termenii si Conditiile!

# register.first_name_length
source: First name should be at least 2 characters long!
ro: Numele ar trebui sa aiba minim 2 caractere!

# register.last_name_length
source: Last name should be at least 2 characters long!
ro: Prenumele ar trebui sa aiba minim 2 caractere!

# forgot_password.submit
source: Forgot your password?
ro: Ti-ai uitat parola?

# login.submit
source: Login
ro: Autentificare

# login.valid_email
source: The email address is invalid!
ro: Adresa de e-mail nu este valida!

# signup.submit
source: Sign up
ro: Inregistrare

# forgot_password.header
source: Password reset
ro: Resetare parola

# forgot_password.text
source: If you have forgotten your password, fill in the form below and you will receive reset instructions via email.
ro: Daca v-ati uitat parola, completati campul de mai jos si veti primi pe e-mail instructiuni pentru a va reseta parola.

# forgot_password.send
source: Send
ro: Trimite

# reset_password.success
source: The password has been reset.
ro: Parola a fost resetata cu succes.

# reset_password.error
source: Error! No account has been found matching your email address.
ro: Eroare! Nu a fost gasit cont asociat adresei de e-mail introduse.

# captcha.error
source: Captcha error. Please try again!
ro: Eroare captcha. Va rugam reincercati!

# topmenu.login
source: Login
ro: Intra in cont

# topmenu.sign_up
source: Sign Up
ro: Creeaza cont

# topmenu.search
source: Search
ro: Cautare

# topmenu.myprofile
source: Profile page
ro: Profilul meu

# topmenu.logout
source: Logout
ro: Deconectare

# reset_password.title
source: Change password
ro: Schimbare parola

# reset_password.submit
source: Change
ro: Schimba parola

# reset_password.general_error
source: An error occurred while changing password. Please ty again in a few moments!
ro: A aparut o eroare la schimbarea datelor. Va rugam sa reincercati!

# reset_password.token_expired
source: This token has expired. Please use the reset password feature again!
ro: Tokenul a expirat. Va rugam sa folositi din nou optiunea de resetare parola.
